src/main/resources/login.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:mes="http://proteo.bs.com/soa/service/mainframe/UserLogin/domain/message" xmlns:head="http://xmlns.bancsabadell.com/proteo/SharedResources/Header" xmlns:dom="http://proteo.bs.com/soa/service/mainframe/UserLogin/domain"><soapenv:Header/><soapenv:Body>    <mes:operation1Request>        <head:HeaderRequest>            <!--Optional:-->            <head:trackingId></head:trackingId>            <!--Optional:-->            <head:step>001</head:step>            <!--Optional:-->            <head:applicationId></head:applicationId>            <!--Optional:-->            <head:language>ES</head:language>            <!--Optional:-->            <head:HostRequest>                <head:sessionId></head:sessionId>                <!--Optional:-->                <head:authorizationId></head:authorizationId>            </head:HostRequest>        </head:HeaderRequest>        <dom:InputData>            <dom:username>IBERPAY</dom:username>            <dom:password>IBERPAY0</dom:password>            <!--Optional:-->            <dom:center></dom:center>            <!--Optional:-->            <dom:enterprise></dom:enterprise>            <!--Optional:-->            <dom:postid></dom:postid>        </dom:InputData>    </mes:operation1Request></soapenv:Body></soapenv:Envelope>